using System;
using System.Collections.Generic;
using System.Text;

namespace Life40Days
{
    public class Events
    {
        private readonly String[] _locations = 
            { "建国门",   "崇文门",   "积水潭",   "苹果园",   "海淀大街",
              "文津街",   "翠微路",   "北京站",   "东直门",   "长椿街", 
              "永安里",   "永定门",   "北辰西路", "八角地铁",  "西直门", 
              "复兴门",   "公主坟",   "方 庄",    "三元东桥",  "菜户营" };

        private readonly String[] _places =
            { "发廊里","早点摊上","报摊上","烤羊肉摊上","公共汽车里","人力车上","女厕所里",
              "男厕所里","电话亭里","三陪女怀里","出租车里","小巴里","美容院里",
              "小商亭里","小商场门口","民工脚下","无照游商摊里","草地上","电线杆顶端",
              "小饭馆里","马路边","人行道上","街心公园里","广告牌下","公共汽车站里",
              "长途汽车站里","卖盗版游戏的旁边","网络公司尸体旁边","行骗的知本家旁边" };

        

    }                                          
}                                               
                                                
                                                